In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',  'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'], 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']}) 

df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are  meant to increase by 10 with each row so 10055 and 10075 need to be put in  place. Fill in these missing numbers and make the column an integer column  (instead of a float column).

In [2]:

prev=df['FlightNumber'][0]
ind=df.index
l=len(ind)
print(l)

for i in range(l):
  if np.isnan(df['FlightNumber'][i]):
    df['FlightNumber'][i]=prev+10
  prev=df['FlightNumber'][i]

df

5

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each  string on the underscore delimiter _ to give a new temporary DataFrame with  the correct values. Assign the correct column names to this temporary  DataFrame.

In [3]:
temp=pd.DataFrame({})
temp=df.From_To.str.split('_',expand=True)
temp.columns=['From','To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this  temporary DataFrame. Standardise the strings so that only the first letter is  uppercase (e.g. "londON" should become "London".)

In [4]:
ind=temp.index
print(ind)
l=len(ind)
print(l)
for i in range(l):
  temp['From'][i]=temp['From'][i].capitalize()
  temp['To'][i]=temp['To'][i].capitalize()
temp

RangeIndex(start=0, stop=5, step=1)
5

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame  from the previous questions.

In [5]:
df=df.drop("From_To",axis=1)
df.insert(0,"From",temp['From'])
df.insert(1,"To",temp['To'])
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris       10045.0      [23, 47]               KLM(!)
1    Madrid      Milan       10055.0            []    <Air France> (12)
2    London  Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      Paris       10075.0          [13]       12. Air France
4  Brussels     London       10085.0      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the  DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value  should be NaN. 
Expand the Series of lists into a DataFrame named delays, rename the columns  delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df  with delays.

In [7]:
ind=df['RecentDelays'].index
ind
l=len(ind)
max=0
for i in range(l):
  l1=len(df["RecentDelays"][i])
  if max<l1:
    max=l1

names=[]
for i in range(max):
  s="delay_"+str(i)
  names.append(s)

a=[]
for i in range(l):
  l=len(df['RecentDelays'][i])
  b=[]
  for j in range(max):
    if l>0:
      b.append(df['RecentDelays'][i][j])
      l=l-1
    else:
      b.append(np.nan)
  a.append(b)

res=pd.DataFrame(a,columns=names)
l=len(df.columns)
for i in range(max):
  df.insert(l,names[i],res[names[i]])
  l=l+1
df=df.drop("RecentDelays",axis=1)
df

       From         To  FlightNumber  ... delay_0  delay_1  delay_2
0    London      Paris       10045.0  ...    23.0     47.0      NaN
1    Madrid      Milan       10055.0  ...     NaN      NaN      NaN
2    London  Stockholm       10065.0  ...    24.0     43.0     87.0
3  Budapest      Paris       10075.0  ...    13.0      NaN      NaN
4  Brussels     London       10085.0  ...    67.0     32.0      NaN

[5 rows x 7 columns]